data/WS-Addressing/ws-addressing-4.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:c30a8d29-44d2-45b2-8911-08545e39c2b9</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address></ReplyTo><FaultTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address></FaultTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1104</notify></S:Body></S:Envelope>